tutorials/compressible/rhoPorousSimpleFoam/angledDuctImplicit/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 200;

boundaryField
{
    front
    {
        type            compressible::epsilonWallFunction;
        value           uniform 200;
    }

    back
    {
        type            compressible::epsilonWallFunction;
        value           uniform 200;
    }

    wall
    {
        type            compressible::epsilonWallFunction;
        value           uniform 200;
    }

    porosityWall
    {
        type            compressible::epsilonWallFunction;
        value           uniform 200;
    }

    inlet
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           uniform 200;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
}

// ************************************************************************* //
